# TriangulationInterfaceForTriangulatedShellComponent Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulationInterfaceForTriangulatedShellComponent Constructor
TriangulationInterfaceForTriangulatedShellComponent Class See Also
---
Constructs an interface object for a TriangulatedShellComponent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TriangulationInterfaceForTriangulatedShellComponent(
	TriangulatedShellComponent externalTriangulatedShellComponent
)
```

Visual Basic
---
```text
Public Sub New ( _
	externalTriangulatedShellComponent As TriangulatedShellComponent _
)
```

Visual C++
---
```text
public:
TriangulationInterfaceForTriangulatedShellComponent(
	TriangulatedShellComponent^ externalTriangulatedShellComponent
)
```

# ### Parameters
externalTriangulatedShellComponent
    Type: Autodesk.Revit.DB..::..TriangulatedShellComponent The TriangulatedShellComponent that the interface object represents.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TriangulationInterfaceForTriangulatedShellComponent Class
Autodesk.Revit.DB Namespace